import requests
from bs4 import BeautifulSoup

url = 'http://106.55.249.213:5001/?user=XAXwaAZAaQ&id='

code_translate = {'\x02': 'AQ', '\x03': 'Ag', '\x04': 'Aw', '\x05': 'BA', '\x06': 'BQ', '': '/w', '  ': 'CA', '\x0e': 'Cg', '\x0f': 'Cw', '\x10': 'DA', '\x11': 'DQ', '\x12': 'Dg', '\x13': 'Dw', '\x14': 'EA', '\x15': 'EQ', '\x16': 'Eg', '\x17': 'Ew', '\x18': 'FA', '\x1b': 'Fw', '\x1c': 'GA', '\x1d': 'GQ', '\x1e': 'Gg', '\x1f': 'Gw', '!': 'HA', '"': 'HQ', '#': 'Hg', '$': 'Hw', '%': 'IA', '&': 'IQ', "'": 'Ig', '(': 'Iw', ')': 'JA', '*': 'JQ', '+': 'Jg', ',': 'Jw', '-': 'KA', '.': 'KQ', '/': 'Kg', '0': 'Kw', '1': 'LA', '2': 'LQ', '3': 'Lg', '4': 'Lw', '5': 'MA', '6': 'MQ', '7': 'Mg', '8': 'Mw', '9': 'NA', ':': 'NQ', ';': 'Ng', '<': 'Nw', '=': 'OA', '>': 'OQ', '?': 'Og', '@': 'Ow', 'A': 'PA', 'B': 'PQ', 'C': 'Pg', 'D': 'Pw', 'E': 'QA', 'F': 'QQ', 'G': 'Qg', 'H': 'Qw', 'I': 'RA', 'J': 'RQ', 'K': 'Rg', 'L': 'Rw', 'M': 'SA', 'N': 'SQ', 'O': 'Sg', 'P': 'Sw', 'Q': 'TA', 'R': 'TQ', 'S': 'Tg', 'T': 'Tw', 'U': 'UA', 'V': 'UQ', 'W': 'Ug', 'X': 'Uw', 'Y': 'VA', 'Z': 'VQ', '[': 'Vg', '\\': 'Vw', ']': 'WA', '^': 'WQ', '_': 'Wg', '`': 'Ww', 'a': 'XA', 'b': 'XQ', 'c': 'Xg', 'd': 'Xw', 'e': 'YA', 'f': 'YQ', 'g': 'Yg', 'h': 'Yw', 'i': 'ZA', 'j': 'ZQ', 'k': 'Zg', 'l': 'Zw', 'm': 'aA', 'n': 'aQ', 'o': 'ag', 'p': 'aw', 'q': 'bA', 'r': 'bQ', 's': 'bg', 't': 'bw', 'u': 'cA', 'v': 'cQ', 'w': 'cg', 'x': 'cw', 'y': 'dA', 'z': 'dQ', '{': 'dg', '|': 'dw', '}': 'eA', '~': 'eQ', '\x7f': 'eg', '聙': 'ew', '聛': 'fA', '聜': 'fQ', '聝': 'fg', '聞': 'fw', '聟': 'gA', '聠': 'gQ', '聡': 'gg', '聢': 'gw', '聣': 'hA', '聤': 'hQ', '聥': 'hg', '聦': 'hw', '聧': 'iA', '聨': 'iQ', '聫': 'ig', '聬': 'iw', '聭': 'jA', '聮': 'jQ', '聯': 'jg', '聰': 'jw', '聲': 'kA', '聳': 'kQ', '聴': 'kg', '聵': 'kw', '聶': 'lA', '職': 'lQ', '聸': 'lg', '聹': 'lw', '聺': 'mA', '聻': 'mQ', '聼': 'mg', '聽': 'mw', '隆': 'nA', '垄': 'nQ', '拢': 'ng', '陇': 'nw', '楼': 'oA', '娄': 'oQ', '搂': 'og', '篓': 'ow', '漏': 'pA', '陋': 'pQ', '芦': 'pg', '卢': 'pw', '颅': 'qA', '庐': 'qQ', '炉': 'qg', '掳': 'qw', '卤': 'rA', '虏': 'rQ', '鲁': 'rg', '麓': 'rw', '碌': 'sA', '露': 'sQ', '路': 'sg', '赂': 'sw', '鹿': 'tA', '潞': 'tQ', '禄': 'tg', '录': 'tw', '陆': 'uA', '戮': 'uQ', '驴': 'ug', '脌': 'uw', '脕': 'vA', '脗': 'vQ', '脙': 'vg', '脛': 'vw', '脜': 'wA', '脝': 'wQ', '脟': 'wg', '脠': 'ww', '脡': 'xA', '脢': 'xQ', '脣': 'xg', '脤': 'xw', '脥': 'yA', '脦': 'yQ', '脧': 'yg', '脨': 'yw', '脩': 'zA', '脪': 'zQ', '脫': 'zg', '脭': 'zw', '脮': '0A', '脰': '0Q', '脳': '0g', '脴': '0w', '脵': '1A', '脷': '1Q', '脹': '1g', '脺': '1w', '脻': '2A', '脼': '2Q', '脽': '2g', '脿': '2w', '谩': '3A', '芒': '3Q', '茫': '3g', '盲': '3w', '氓': '4A', '忙': '4Q', '莽': '4g', '猫': '4w', '茅': '5A', '锚': '5Q', '毛': '5g', '矛': '5w', '铆': '6A', '卯': '6Q', '茂': '6g', '冒': '6w', '帽': '7A', '貌': '7Q', '贸': '7g', '么': '7w', '玫': '8A', '枚': '8Q', '梅': '8g', '酶': '8w', '霉': '9A', '煤': '9Q', '没': '9g', '眉': '9w', ' ': 'KgJQJQKg'}

while(True):
    user_input = input()
    if user_input == 'quit':
        break
    
    result = ''
    for i in user_input:
        result += str(code_translate[i])
    print(result)
    
    print(requests.get(url + result, 'html.parser').text)